In [4]:
import pandas as pd
import numpy as np

# train_data = open('P3train.txt', 'r')
            
# lines, columns = train_data.readline().split()
# x_train = pandas.DataFrame(np.ones((int(lines), 1)))
# x_train1 = pandas.DataFrame(np.ones((int(lines), 3)))
# y_train1 = pandas.DataFrame(np.ones((int(lines), 1)))
# x_train1.loc[i,1]
# for i in range(int(lines)):
#     x_train1.loc[i,1], x_train1.loc[i,2], y_train1.loc[i, 0]  = train_data.readline().split()
# train_data.close()

# test_data = open('P3test.txt', 'r')

# lines, columns = test_data.readline().split()
# x_test = pandas.DataFrame(np.ones((int(lines), 1)))
# x_test1 = pandas.DataFrame(np.ones((int(lines), 3)))
# y_test1 = pandas.DataFrame(np.ones((int(lines), 1)))

# for i in range(int(lines)):
#     x_test1.loc[i,1], x_test1.loc[i,2], y_test1.loc[i, 0]  = test_data.readline().split()
# test_data.close()



# z = 0
# Power = 2
# for j in range(Power+1): 
#     for i in range(Power+1):
#         temp = (x_test1[1].astype(float).pow(i)).multiply((x_test1[2].astype(float).pow(j)))
#         x_test[z] = temp
#         z  +=1

# z = 0
# Power = 2
# for j in range(Power+1): 
#     for i in range(Power+1):
#         temp = (x_train1[1].astype(float).pow(i)).multiply((x_train1[2].astype(float).pow(j)))
#         x_train[z] = temp
#         z  +=1

In [17]:
df1=pd.DataFrame({0:[14,4,5,4,1],
                  1:[5,2,54,3,2],
                  2:[20,20,7,3,8],
                  3:[14,3,6,2,6]})

In [18]:
df1

    0   1   2   3
0  14   5  20  14
1   4   2  20   3
2   5  54   7   6
3   4   3   3   2
4   1   2   8   6

In [27]:
sr = pd.Series(np.array([3, 2, 4, 5, 6]))
df1.mul(sr, axis = 1)

    0    1   2   3   4
0  42   10  80  70 NaN
1  12    4  80  15 NaN
2  15  108  28  30 NaN
3  12    6  12  10 NaN
4   3    4  32  30 NaN

In [26]:
df1.sum(axis = 1)

0    53
1    29
2    72
3    12
4    17
dtype: int64